docs/verification/owned-outcome/evidence-r3/engine/mutants/quote-membership-ignored/mutation.diff
--- base/engine/scripts/lib/owned-dispatch.py
+++ mutant/engine/scripts/lib/owned-dispatch.py
@@ -125,7 +125,7 @@
             matches = [r for r in data['standing_rulings'] if r['path'] == path]
             if len(matches) == 1:
                 source = matches[0]['text']
-        if not isinstance(quote, str) or not quote.strip() or source is None or quote not in source:
+        if not isinstance(quote, str) or not quote.strip() or source is None:
             raise ValueError('Authority quote is not from a CEO message or declared ruling')
     return verdict['kind']
 
