docs/verification/owned-outcome/evidence-r3/engine/mutants/broken-fails-closed/mutation.diff
--- base/engine/scripts/hooks/guard-ceo-ask-first.sh
+++ mutant/engine/scripts/hooks/guard-ceo-ask-first.sh
@@ -186,7 +186,7 @@
     1) exit 0 ;;                    # NOT-DECLARED: no CEO list here, stand down
     *)
         announce_broken "CEO-ASK GATE IS OFF: this repository DECLARES CEO TODOs and they cannot be read — ${CA_REASON}. Teammate dispatches are UNGATED, and a declared-but-unreadable list is not an empty one."
-        exit 0 ;;
+        exit 2 ;;
 esac
 
 # --- Parse the spawn --------------------------------------------------------
