docs/verification/owned-outcome/evidence-r3/engine/mutants/child-binding-ignored/mutation.diff
--- base/engine/scripts/lib/owned-dispatch.py
+++ mutant/engine/scripts/lib/owned-dispatch.py
@@ -85,7 +85,7 @@
                         and Path(candidate.get('workspace', '')).resolve() == root.resolve()
                         and candidate.get('source_transcript') == str(Path(transcript).resolve())):
                     saved = candidate
-        if payload.get('agent_id') and saved is None:
+        if False:
             raise ValueError('Child dispatch has no verified leader-source binding')
         if saved is not None:
             messages = [{'role': m['role'], 'text': m['text']} for m in saved['messages']]
