docs/verification/owned-outcome/evidence-r3/engine/mutants/ruling-state-not-read/mutation.diff
--- base/engine/scripts/lib/owned-dispatch.py
+++ mutant/engine/scripts/lib/owned-dispatch.py
@@ -99,7 +99,7 @@
     except (OSError, ValueError, TypeError, KeyError):
         unavailable = True
     data = {'proposed_dispatch': payload['tool_input'], 'pending_items': pending,
-            'messages': messages, 'standing_rulings': sources, 'source_unavailable': unavailable}
+            'messages': messages, 'standing_rulings': [], 'source_unavailable': unavailable}
     return config, data
 
 
