docs/verification/owned-outcome/evidence-r3/engine/mutants/saved-source-dropped/mutation.diff
--- base/engine/scripts/lib/owned-dispatch.py
+++ mutant/engine/scripts/lib/owned-dispatch.py
@@ -87,7 +87,7 @@
                     saved = candidate
         if payload.get('agent_id') and saved is None:
             raise ValueError('Child dispatch has no verified leader-source binding')
-        if saved is not None:
+        if False:
             messages = [{'role': m['role'], 'text': m['text']} for m in saved['messages']]
             known = set(saved.get('source_ids', []))
             # Membership is by native source ID. A repeated CEO answer after a
